///*
//小明手里有n元钱，全部用来买书，书的价格为10元，20元，50元，100元，
//问，小明有多少种方案？(每本书可购买多本)
//
//输入：
//一个整数n,代表总钱数.
//
//输出:
//一个整数,代表选择方案总数
//
//输入示例：
//20
//
//输出示例：
//2
//*/
//
//#include<iostream>
//using namespace std;
//
//long n;
//long a[5] = { 0,10,20,50,100 };
//long dp[1001];
//
//int main()
//{
//	cin >> n;
//
//	dp[0] = 1;
//	for (long i = 1; i <= 4; ++i)
//		for (long j = a[i]; j <= n; ++j)
//			dp[j] = dp[j] + dp[j - a[i]];
//
//	cout << dp[n] << endl;
//
//	return 0;
//}