/////*
////一个旅行者有一个最多能装m公斤的背包，现在有n件物品，它们的重量分别是w1，w2,...,wn，
////他们的价值分别为c1，c2,...,cn，求旅行者能获得的最大总价值.
////
////输入:
////第一行两个整数m和n，第二到n+1行，每行两个整数，wi,ci表示每个物品的重量和价值.
////
////输出:
////仅一行，一个数，表示最大总价值。
////
////输入示例：
////10 4
////2  1
////3  3
////4  5 
////7  9
////
////输出示例：
////12
////*/
////
//#include<iostream>
//using namespace std;
//
//long m;  //背包容量
//long n;  //物品数量
//long w[101], c[101];
//long dp[201];   //dp[i]表示用了i公斤的容量所能获得的最大价值
//
//int main()
//{
//	cin >> m >> n;
//	for (long i = 1; i <= n; ++i)
//		cin >> w[i] >> c[i];
//
//	for (long i = 1; i <= n; ++i)
//		for (long j = m; j >= w[i]; --j)
//			dp[j] = max(dp[j], dp[j - w[i]] + c[i]);
//
//	cout << dp[m] << endl;
//
//	return 0;
//}