///*
//有一个箱子容量为m，同时有n个物品，每个物品有一个体积,
//要求n个物品中,任取若干个装入箱内，使箱子的剩余空间为最小.
//
//输入:
//第一行是一个整数m表示箱子容量，
//第二行是一个整数n表示物品数，
//接下来n行每行一个正整数，分别表示这n个物品的体积
//
//输出:
//一个整数,表示箱子的剩余空间
//
//输入示例：
//24
//6
//8 
//3
//12
//7
//9
//7
//
//输出示例：
//0
//*/
//
//#include<iostream>
//using namespace std;
//
//long m, n;
//long a[31];
//long dp[20001];
//
//int main()
//{
//	cin >> m >> n;
//	for (long i = 1; i <= n; ++i)
//		cin >> a[i];
//
//	for (long i = 1; i <= n; ++i)
//		for (long j = m; j >= a[i]; --j)
//			dp[j] = max(dp[j], dp[j - a[i]] + a[i]);
//
//	cout << m - dp[m] << endl;
//
//	return 0; 
//}